window.onload = function () {
    var citys = [{"letter": "A", "city": ["阿尔山", "安康", "阿克苏", "阿里河", "阿拉山口", "安平", "安庆", "安顺", "鞍山", "安阳", "昂昂溪", "阿城", "安达", "安德", "安定", "安多", "安广", "敖汉", "艾河", "安化", "艾家村", "安家", "阿金", "安靖", "阿克陶", "安口窑", "敖力布告", "安龙", "阿龙山", "安陆", "阿木尔", "阿南庄", "安庆西", "鞍山西", "安塘", "安亭北", "阿图什", "安图", "安溪", "阿巴嘎旗", "阿尔山北", "阿勒泰", "安仁", "安顺西", "安图西", "安阳东"]}, {"letter": "B", "city": ["北京北", "北京东", "北京", "北京南", "北京西", "北安", "蚌埠", "白城", "北海", "白河", "白涧", "宝鸡", "滨江", "博克图", "百色", "白山市", "北台", "包头东", "北屯市", "本溪", "白云鄂博", "白银西", "博鳌", "北碚", "白壁关", "蚌埠南", "巴楚", "板城", "北戴河", "保定", "宝坻", "八达岭", "巴东", "柏果", "布海", "白河东", "宝华山", "白河县", "白芨沟", "碧鸡关", "北滘", "碧江", "白鸡坡", "笔架山", "八角台", "保康", "白奎堡", "白狼", "百浪", "博乐", "宝拉格", "巴林", "宝林", "北流", "勃利", "布列开", "宝龙山", "百里峡", "八面城", "班猫箐", "八面通", "北马圈子", "北票南", "白旗", "宝泉岭", "白泉", "巴山", "白水江", "白沙坡", "白石山", "白水镇", "包头", "泊头", "北屯", "本溪湖", "博兴", "八仙筒", "白音察干", "背荫河", "北营", "巴彦高勒", "白音他拉", "白银市", "白音胡硕", "巴中", "霸州", "北宅", "博白", "八步", "保定东", "八方山", "白沟", "滨海", "滨海北", "宝鸡南", "北井子", "白马井", "宝清", "白沙铺", "白水县", "板塘", "白文东", "宾西北", "本溪新城", "彬县", "宾阳", "白洋淀", "百宜", "白音华南", "巴中东", "滨州", "宾州", "霸州西", "亳州"]}, {"letter": "C", "city": ["重庆北", "重庆", "重庆南", "重庆西", "长春", "长春南", "长春西", "成都东", "成都南", "成都", "长沙", "长沙南", "赤壁", "常德", "承德", "长甸", "赤峰", "茶陵", "苍南", "昌平", "崇仁", "昌图", "长汀镇", "曹县", "楚雄南", "陈相屯", "长治北", "池州", "长征", "常州", "郴州", "长治", "沧州", "崇左", "赤壁北", "查布嘎", "长城", "长冲", "承德东", "赤峰西", "柴岗", "长葛", "柴沟堡", "城固", "陈官营", "成高子", "草海", "柴河", "册亨", "草河口", "崔黄口", "巢湖", "蔡家沟", "成吉思汗", "岔江", "蔡家坡", "昌乐", "超梁沟", "慈利", "昌黎", "长岭子", "晨明", "长农", "昌平北", "常平", "长坡岭", "辰清", "蔡山", "楚山", "长寿", "磁山", "苍石", "草市", "察素齐", "长山屯", "长汀", "朝天南", "昌图西", "春湾", "磁县", "辰溪", "磁西", "长兴南", "磁窑", "春阳", "城阳", "创业村", "朝阳川", "朝阳地", "朝阳南", "长垣", "朝阳镇", "滁州北", "常州北", "滁州", "潮州", "常庄", "曹子里", "车转湾", "郴州西", "沧州西", "澄城", "城固北", "巢湖东"]}, {"letter": "D", "city": ["大明湖", "大安北", "大成", "丹东", "东方红", "东莞东", "大虎山", "敦化", "敦煌", "德惠", "东京城", "大涧", "都江堰", "大连北", "大理", "大连", "定南", "大庆", "东胜", "大石桥", "大同", "东营", "大杨树", "都匀", "邓州", "达州", "德州", "德安", "大安", "大坝", "大板", "大巴", "电白", "到保", "定边", "东边井", "德伯斯", "打柴沟", "德昌", "滴道", "大磴沟", "刀尔登", "得耳布尔", "杜尔伯特", "东方", "丹凤", "东丰", "都格", "大官屯", "大关", "东光", "东海", "大灰厂", "大红旗", "大禾塘", "德惠西", "东海县", "达家沟", "东津", "杜家", "大口屯", "东来", "德令哈", "大陆号", "带岭", "大林", "达拉特旗", "独立屯", "豆罗", "达拉特西", "大连西", "东明村", "洞庙河", "东明县", "大拟", "大平房", "大盘石", "大埔", "大堡", "大庆东", "大其拉哈", "道清", "对青山", "德清西", "大庆西", "东升", "独山", "登沙河", "读书铺", "大石头", "东胜西", "大石寨", "东台", "定陶", "灯塔", "大田边", "东通化", "丹徒", "大屯", "东湾", "大武口", "低窝铺", "大王滩", "大湾子", "大兴沟", "大兴", "定西", "甸心", "东乡", "代县", "定襄", "东戌", "东辛庄", "丹阳", "德阳", "大雁", "当阳", "丹阳北", "大英东", "东淤地", "大营", "定远", "大元", "大营镇", "大营子", "大战场", "德州东", "东至", "低庄", "东镇", "道州", "东庄", "兑镇", "豆庄", "定州", "大竹园", "大杖子", "豆张庄"]}, {"letter": "E", "city": ["额济纳", "二连", "恩施", "峨边", "二道沟门", "二道湾", "鄂尔多斯", "二龙", "二龙山屯", "峨眉", "二密河", "恩平", "二营", "鄂州"]}, {"letter": "F", "city": ["福州", "福州南", "福鼎", "凤凰机场", "风陵渡", "涪陵", "富拉尔基", "抚顺北", "佛山", "阜新南", "阜阳", "福安", "丰城", "丰城南", "肥东", "发耳", "富海", "福海", "凤凰城", "汾河", "奉化", "富锦", "范家屯", "福利区", "福利屯", "丰乐镇", "阜南", "阜宁", "抚宁", "福清", "福泉", "丰水村", "丰顺", "繁峙", "抚顺", "福山口", "扶绥", "冯屯", "浮图峪", "富县东", "凤县", "富县", "费县", "凤阳", "汾阳", "扶余北", "分宜", "富源", "扶余", "富裕", "抚州北", "凤州", "丰镇", "范镇"]}, {"letter": "G", "city": ["广州南", "广州东", "贵阳", "广州", "广州西", "格尔木", "广汉", "古交", "桂林北", "古莲", "桂林", "固始", "广水", "干塘", "广元", "广州北", "赣州", "公主岭", "公主岭南", "固安", "广安", "高碑店", "沟帮子", "甘草店", "谷城", "高村", "古城镇", "广德", "贵定", "贵定南", "古东", "贵港", "官高", "葛根庙", "干沟", "甘谷", "高各庄", "甘河", "根河", "郭家店", "孤家子", "古浪", "皋兰", "高楼房", "归流河", "关林", "甘洛", "郭磊庄", "高密", "公庙子", "工农湖", "广宁寺南", "广南卫", "高平", "甘泉北", "共青城", "甘旗卡", "甘泉", "高桥镇", "灌水", "赶水", "孤山口", "果松", "高山子", "嘎什甸子", "高台", "高滩", "古田", "官厅", "官厅西", "贵溪", "巩义", "高邑", "巩义南", "广元南", "固原", "菇园", "公营子", "光泽", "古镇", "固镇", "瓜州", "高州", "盖州", "官字井", "冠豸山", "盖州西"]}, {"letter": "H", "city": ["哈尔滨", "哈尔滨东", "哈尔滨西", "合肥", "合肥西", "呼和浩特东", "呼和浩特", "海口东", "海口", "杭州东", "杭州", "杭州南", "淮安", "淮北", "鹤北", "淮滨", "河边", "韩城", "邯郸", "横道河子", "鹤岗", "皇姑屯", "红果", "黑河", "怀化", "汉口", "葫芦岛", "海拉尔", "霍林郭勒", "海伦", "侯马", "哈密", "淮南", "海宁西", "鹤庆", "怀柔北", "怀柔", "黄石东", "华山", "黄山", "黄石", "衡水", "衡阳", "菏泽", "贺州", "汉中", "惠州", "海安", "淮安南", "红安", "红安西", "黄柏", "海北", "鹤壁", "会昌北", "华城", "河唇", "汉川", "海城", "合川", "黑冲滩", "黄村", "海城西", "化德", "洪洞", "霍尔果斯", "横峰", "韩府湾", "汉沽", "黄瓜园", "红光镇", "浑河", "红花沟", "黄花筒", "贺家店", "和静", "红江", "黑井", "获嘉", "河津", "涵江", "华家", "杭锦后旗", "河间西", "花家庄", "河口南", "湖口", "黄口", "呼兰", "葫芦岛北", "浩良河", "哈拉海", "鹤立", "黄陵", "海林", "虎林", "寒岭", "和龙", "海龙", "哈拉苏", "呼鲁斯太", "火连寨", "黄梅", "韩麻营", "黄泥河", "海宁", "惠农", "和平", "花棚子", "花桥", "宏庆", "怀仁", "华容", "华山北", "黄松甸", "和什托洛盖", "红山", "汉寿", "衡山", "黑水", "惠山", "虎什哈", "红寺堡", "虎石台", "海石湾", "衡山西", "红砂岘", "黑台", "桓台", "和田", "会同", "海坨子", "黑旺", "海湾", "红星", "徽县", "红兴隆", "换新天", "红岘台", "红彦", "海晏", "合阳", "海阳", "衡阳东", "华蓥", "汉阴", "黄羊滩", "汉源", "河源", "花园", "黄羊镇", "湖州", "化州", "黄州", "霍州", "惠州西", "潢川", "桦南"]}, {"letter": "J", "city": ["济南", "济南西", "吉安", "集安", "江边村", "晋城", "金城江", "景德镇", "嘉峰", "加格达奇", "井冈山", "金华南", "金华", "九江", "吉林", "荆门", "佳木斯", "济宁", "集宁南", "酒泉", "江山", "吉首", "九台", "镜铁山", "鸡西", "绩溪县", "嘉峪关", "江油", "金州", "锦州", "蓟州", "巨宝", "靖边", "金宝屯", "晋城北", "金昌", "交城", "建昌", "峻德", "井店", "鸡东", "江都", "鸡冠山", "金沟屯", "静海", "金河", "锦河", "精河", "精河南", "江华", "建湖", "纪家沟", "晋江", "锦界", "姜家", "江津", "金坑", "金马村", "江门东", "角美", "井南", "建瓯", "经棚", "江桥", "九三", "金山北", "嘉善", "京山", "建始", "吉舒", "建设", "甲山", "建三江", "嘉善南", "金山屯", "江所田", "景泰", "九台南", "吉文", "进贤", "嘉祥", "介休", "嘉兴", "井陉", "嘉兴南", "夹心子", "姜堰", "简阳", "揭阳", "建阳", "巨野", "江永", "靖远", "江源", "济源", "靖远西", "胶州北", "焦作东", "金寨", "靖州", "荆州", "胶州", "晋州", "锦州南", "焦作", "旧庄窝", "金杖子", "蛟河"]}, {"letter": "K", "city": ["昆明", "昆明西", "库尔勒", "开封", "凯里", "喀什", "昆山南", "奎屯", "开原", "开安", "库车", "康城", "库都尔", "宽甸", "克东", "昆都仑召", "开江", "康金井", "喀喇其", "开鲁", "克拉玛依", "开平南", "口前", "昆山", "奎山", "克山", "开通", "康熙岭", "昆阳", "克一河", "开原西", "康庄", "岢岚"]}, {"letter": "L", "city": ["拉萨", "兰州东", "兰州", "兰州西", "六安", "灵宝", "芦潮港", "隆昌", "陆川", "利川", "临川", "潞城", "鹿道", "娄底", "临汾", "良各庄", "临河", "绿化", "隆化", "丽江", "临江", "龙井", "吕梁", "柳林南", "滦平", "六盘水", "灵丘", "旅顺", "兰溪", "陇西", "临西", "龙岩", "洛阳", "连云港东", "洛阳东", "临沂", "洛阳龙门", "柳园", "凌源", "辽源", "立志", "柳州", "辽中", "来宾", "老边", "灵宝西", "龙川", "乐昌", "黎城", "聊城", "蓝村", "两当", "林东", "乐都", "梁底下", "六道河子", "鲁番", "廊坊", "落垡", "廊坊北", "老府", "兰岗", "龙骨甸", "芦沟", "龙沟", "拉古", "临海", "林海", "拉哈", "凌海", "柳河", "六合", "龙华", "滦河沿", "六合镇", "亮甲店", "刘家店", "刘家河", "连江", "庐江", "李家", "罗江", "廉江", "两家", "龙江", "龙嘉", "莲江口", "李家坪", "兰考", "林口", "路口铺", "老莱", "拉林", "陆良", "龙里", "临澧", "兰棱", "零陵", "卢龙", "喇嘛甸", "里木店", "洛门", "龙南", "梁平", "罗平", "落坡岭", "六盘山", "乐平市", "临清", "龙泉寺", "乐山北", "乐善村", "冷水江东", "连山关", "流水沟", "丽水", "陵水", "罗山", "鲁山", "梁山", "灵石", "露水河", "庐山", "林盛堡", "柳树屯", "龙山镇", "梨树镇", "李石寨", "黎塘", "轮台", "芦台", "龙塘坝", "骆驼巷", "李旺", "莱芜东", "狼尾山", "灵武", "莱芜西", "朗乡", "陇县", "临湘", "芦溪", "莱西", "林西", "滦县", "莱阳", "略阳", "辽阳", "临沂北", "凌源东", "连云港", "临颍", "老营", "龙游", "罗源", "林源", "涟源", "临泽", "龙爪沟", "雷州", "六枝", "鹿寨", "来舟", "龙镇", "拉鲊", "兰州新区", "乐清", "漯河", "醴陵", "澧县", "耒阳"]}, {"letter": "M", "city": ["麻城", "免渡河", "牡丹江", "莫尔道嘎", "明光", "满归", "漠河", "茂名", "茂名西", "密山", "马三家", "麻尾", "绵阳", "梅州", "满洲里", "马鞍山", "毛坝", "毛坝关", "麻城北", "明城", "庙城", "茅草坪", "猛洞河", "磨刀石", "弥渡", "帽儿山", "明港", "梅河口", "马皇", "孟家岗", "美兰", "马莲河", "茅岭", "庙岭", "茂林", "穆棱", "马林", "马龙", "木里图", "玛纳斯湖", "冕宁", "马桥河", "闽清", "民权", "明水河", "麻山", "眉山", "漫水湾", "茂舍祖", "米沙子", "马踏", "美溪", "勉县", "麻阳", "密云北", "米易", "麦园", "墨玉", "庙庄", "米脂", "明珠"]}, {"letter": "N", "city": ["南昌", "南京", "南京南", "南宁", "宁波东", "宁波", "南岔", "南充", "南丹", "南大庙", "南芬", "嫩江", "内江", "南平", "南通", "南阳", "碾子山", "宁安", "农安", "南博山", "南仇", "南城司", "宁村", "宁德", "南观村", "南宫东", "南关岭", "宁国", "宁海", "南华北", "南河川", "泥河子", "宁家", "南靖", "牛家", "能家", "南口", "南口前", "南朗", "乃林", "尼勒克", "那罗", "宁陵县", "奈曼", "宁明", "南木", "南平南", "那铺", "南桥", "那曲", "暖泉", "南台", "南头", "宁武", "南湾子", "南翔北", "宁乡", "内乡", "牛心台", "南峪", "娘子关", "南召", "南杂木", "讷河"]}, {"letter": "P", "city": ["平顶山", "盘锦", "平凉", "平凉南", "平泉", "坪石", "萍乡", "凭祥", "攀枝花", "蓬安", "平安", "平安驿", "磐安镇", "平安镇", "蒲城东", "蒲城", "裴德", "偏店", "平顶山西", "坡底下", "瓢儿屯", "平房", "平岗", "平关", "盘关", "平果", "徘徊北", "平河口", "平湖", "盘锦北", "潘家店", "皮口南", "普兰店", "偏岭", "平山", "彭山", "皮山", "磐石", "平社", "彭水", "平台", "平田", "莆田", "葡萄菁", "普湾", "平旺", "平型关", "普雄", "蓬溪", "平洋", "彭阳", "平遥", "平邑", "平原堡", "平原", "平峪", "彭泽", "平庄", "泡子", "平庄南", "郫县西"]}, {"letter": "Q", "city": ["青城山", "青岛", "清河城", "曲靖", "黔江", "前进镇", "齐齐哈尔", "七台河", "沁县", "泉州东", "泉州", "乾安", "庆安", "迁安", "祁东北", "七甸", "曲阜东", "庆丰", "奇峰塔", "曲阜", "琼海", "秦皇岛", "千河", "清河", "清河门", "清华园", "全椒", "渠旧", "潜江", "秦家", "祁家堡", "清涧县", "秦家庄", "七里河", "秦岭", "渠黎", "青龙", "青龙山", "祁门", "前磨头", "青山", "确山", "前山", "清水", "戚墅堰", "青田", "桥头", "青铜峡", "前卫", "前苇塘", "渠县", "祁县", "青县", "桥西", "清徐", "旗下营", "千阳", "沁阳", "泉阳", "祁阳北", "七营", "庆阳山", "清远", "清原", "钦州东", "钦州", "青州市", "蕲春", "衢州"]}, {"letter": "R", "city": ["融安", "汝箕沟", "瑞金", "日照", "瑞安", "荣昌", "瑞昌", "如皋", "容桂", "任丘", "乳山", "融水", "热水", "容县", "饶阳", "汝阳", "绕阳河", "汝州"]}, {"letter":"S", "city": ["上海", "上海南", "上海虹桥", "上海西", "石家庄北", "石家庄", "沈阳", "沈阳北", "沈阳东", "沈阳南", "太原北", "太原东", "太原", "双城堡", "绥芬河", "韶关东", "山海关", "绥化", "三间房", "苏家屯", "舒兰", "神木南", "三门峡", "商南", "遂宁", "四平", "商丘", "上饶", "韶山", "宿松", "汕头", "邵武", "涉县", "三亚", "邵阳", "十堰", "三元区", "双鸭山", "松原", "苏州", "深圳", "宿州", "随州", "朔州", "深圳西", "塘豹", "塔尔气", "塘沽", "塔河", "泰来", "泰山", "太阳升", "泰州", "石坝", "上板城", "施秉", "上板城南", "世博园", "双城北", "舒城", "商城", "莎车", "顺昌", "神池", "沙城", "石城", "山城镇", "山丹", "顺德", "绥德", "水洞", "商都", "十渡", "四道湾", "顺德学院", "绅坊", "双丰", "四方台", "水富", "三关口", "桑根达来", "韶关", "上高镇", "上杭", "沙海", "蜀河", "松河", "沙河", "沙河口", "赛汗塔拉", "沙河市", "沙后所", "山河屯", "三河县", "四合永", "三汇镇", "双河镇", "石河子", "三合庄", "三家店", "水家湖", "沈家河", "松江河", "尚家", "孙家", "沈家", "双吉", "松江", "三江口", "司家岭", "松江南", "石景山南", "邵家堂", "三江县", "三家寨", "十家子", "松江镇", "施家嘴", "深井子", "什里店", "疏勒", "疏勒河", "舍力虎", "石磷", "石林", "双辽", "绥棱", "石岭", "石林南", "石龙", "萨拉齐", "索伦", "商洛", "沙岭子", "石门县北", "三门峡南", "三门县", "石门县", "三门峡西", "肃宁", "宋", "双牌", "沙坪坝", "四平东", "遂平", "沙坡头", "沙桥", "商丘南", "水泉", "石泉县", "石桥子", "石人城", "石人", "山市", "神树", "三水", "石山", "松树", "首山", "三十家", "三十里堡", "双水镇", "松树镇", "松桃", "索图罕", "三堂集", "石头", "神头", "沙沱", "上万", "孙吴", "沙湾县", "遂溪", "沙县", "绍兴", "石岘", "上西铺", "石峡子", "绥阳", "寿阳", "水洋", "三阳川", "上腰墩", "三营", "顺义", "三义井", "三源浦", "上虞", "三原", "上园", "水源", "桑园子", "绥中北", "苏州北", "宿州东", "深圳东", "深州", "孙镇", "绥中", "尚志", "师庄", "松滋", "师宗", "苏州园区", "苏州新区"]}, {"letter": "T", "city": ["天津北", "天津", "天津南", "天津西", "通化", "吐鲁番", "通辽", "铁岭", "陶赖昭", "图们", "铜仁", "唐山北", "田师府", "唐山", "天水", "通远堡", "桐梓", "通州西", "通安驿", "桐柏", "通北", "桐城", "铁厂", "桃村", "通道", "田东", "天岗", "土贵乌拉", "通沟", "棠海", "唐河", "团结", "陶家屯", "唐家湾", "统军庄", "吐列毛杜", "图里河", "铜陵", "田林", "亭亮", "铁力", "铁岭西", "图们北", "天门", "天门南", "土牧尔台", "土门子", "图强", "天桥岭", "土桥子", "桃山", "通途", "同心", "土溪", "桐乡", "田阳", "天义", "驼腰岭", "天祝", "天镇", "桐子林", "天柱山", "潼关", "泰安", "台安", "汤池", "太谷", "塔哈", "泰和", "太湖", "谭家井", "太姥山", "太平川", "太平镇", "台前", "汤山城", "台山", "塔石嘴", "汤旺河", "汤阴", "太阳山", "汤原", "塔崖驿", "台州"]}, {"letter": "W", "city": ["武汉", "王家营西", "乌鲁木齐", "五常", "武昌", "瓦房店", "威海", "芜湖", "乌海西", "吴家屯", "乌鲁木齐南", "武隆", "乌兰浩特", "渭南", "威舍", "歪头山", "武威", "武威南", "无锡", "乌西", "乌伊岭", "武夷山", "万源", "万州", "梧州", "温州", "温州南", "涡阳", "文安", "武安", "王安镇", "吴堡", "旺苍", "五叉沟", "文昌", "温春", "五大连池", "文登", "五道沟", "五道河", "文地", "卫东", "武当山", "望都", "乌尔旗汗", "潍坊", "万发屯", "王府", "瓦房店西", "王岗", "武功", "湾沟", "吴官田", "乌海", "苇河", "卫辉", "吴家川", "五家", "威箐", "午汲", "渭津", "王家湾", "五棵树", "五龙背", "乌兰哈达", "万乐", "瓦拉干", "温岭", "五莲", "乌拉特前旗", "乌拉山", "卧里屯", "渭南北", "乌奴耳", "万宁", "万年", "渭南南", "渭南镇", "沃皮", "吴桥", "汪清", "武清", "武山", "文水", "魏善庄", "王瞳", "五台山", "王团庄", "五五", "无锡东", "卫星", "闻喜", "武乡", "无锡新区", "武穴", "吴圩", "王杨", "武义", "五营", "瓦窑田", "五原", "苇子沟", "韦庄", "五寨", "王兆屯", "微子镇", "魏杖子"]}, {"letter": "X", "city": ["香港西九龙", "西安北", "西安", "西安南", "西宁", "西昌", "许昌", "西昌南", "锡林浩特", "厦门北", "厦门", "厦门高崎", "宣威", "新乡", "信阳", "咸阳", "襄阳", "熊岳城", "新余", "徐州", "新安", "兴安", "新安县", "新保安", "下板城", "西八里", "宣城", "兴城", "小村", "新绰源", "下城子", "新城子", "喜德", "小得江", "西大庙", "小董", "小东", "香坊", "信丰", "襄汾", "息烽", "新干", "轩岗", "孝感", "西固城", "兴国", "西固", "夏官营", "西岗子", "宣汉", "襄河", "新和", "宣和", "斜河涧", "新华屯", "新会", "新华", "新晃", "新化", "宣化", "兴和西", "小河沿", "下花园", "小河镇", "徐家", "峡江", "新绛", "辛集", "新江", "西街口", "许家屯", "许家台", "谢家镇", "兴凯", "小榄", "香兰", "兴隆店", "新乐", "新林", "小岭", "新李", "西林", "西柳", "仙林", "新立屯", "兴隆县", "兴隆镇", "新立镇", "新民", "西麻山", "下马塘", "孝南", "咸宁北", "兴宁", "咸宁", "犀浦东", "西平", "兴平", "新坪田", "霞浦", "犀浦", "新青", "新邱", "兴泉堡", "仙人桥", "小寺沟", "杏树", "下社", "小市", "徐水", "夏石", "小哨", "秀山", "新松浦", "杏树屯", "许三湾", "湘潭", "邢台", "向塘", "仙桃西", "下台子", "徐闻", "新窝铺", "修武", "新县", "息县", "西乡", "湘乡", "西峡", "孝西", "小新街", "新兴县", "西小召", "小西庄", "向阳", "旬阳", "旬阳北", "襄阳东", "兴业", "小雨谷", "新沂", "兴义", "信宜", "小月旧", "小扬气", "襄垣", "夏邑县", "祥云西", "新友谊", "新阳镇", "徐州东", "新帐房", "悬钟", "新肇", "忻州", "汐子", "西哲里木", "新杖子"]}, {"letter": "Y", "city": ["银川", "延安", "宜宾", "亚布力南", "叶柏寿", "宜昌东", "永川", "盐城", "宜昌", "运城", "伊春", "榆次", "杨村", "宜春西", "伊尔施", "燕岗", "永济", "延吉", "营口", "牙克石", "阎良", "玉林", "榆林", "亚龙湾", "一面坡", "伊宁", "阳平关", "玉屏", "原平", "延庆", "阳泉曲", "玉泉", "阳泉", "营山", "玉山", "燕山", "榆树", "鹰潭", "烟台", "伊图里河", "玉田县", "义乌", "阳新", "义县", "益阳", "岳阳", "崖州", "永州", "扬州", "姚安", "依安", "永安", "永安乡", "亚布力", "元宝山", "羊草", "秧草地", "阳澄湖", "迎春", "叶城", "盐池", "砚川", "阳春", "宜城", "应城", "禹城", "阳城", "阳岔", "雁翅", "云彩岭", "虞城县", "营城子", "英德", "永登", "尹地", "永定", "阳东", "雁荡山", "于都", "园墩", "英德西", "永丰营", "杨岗", "阳高", "阳谷", "友好", "余杭", "沿河城", "岩会", "羊臼河", "永嘉", "营街", "盐津", "阳江", "余江", "燕郊", "姚家", "岳家井", "一间堡", "英吉沙", "云居寺", "燕家庄", "永康", "营口东", "银浪", "永郎", "宜良北", "永乐店", "伊拉哈", "伊林", "杨陵", "彝良", "杨林", "余粮堡", "杨柳青", "月亮田", "义马", "阳明堡", "玉门", "云梦", "元谋", "一面山", "沂南", "宜耐", "伊宁东", "营盘水", "羊堡", "阳泉北", "焉耆", "源迁", "姚千户屯", "阳曲", "榆树沟", "月山", "玉石", "玉舍", "沂水", "榆社", "窑上", "元氏", "杨树岭", "野三坡", "榆树屯", "榆树台", "鹰手营子", "源潭", "牙屯堡", "烟筒山", "烟筒屯", "羊尾哨", "越西", "阳西", "永修", "玉溪西", "余姚", "酉阳", "岳阳东", "阳邑", "鸭园", "鸳鸯镇", "燕子砭", "仪征", "宜州", "羊者窝", "杨杖子"]}, {"letter": "Z", "city": ["郑州", "淄博", "镇城底", "自贡", "珠海", "珠海北", "湛江", "镇江", "张家界", "张家口", "张家口南", "周口", "哲里木", "扎兰屯", "驻马店", "肇庆", "周水子", "昭通", "中卫", "资阳", "遵义西", "枣庄", "资中", "株洲", "枣庄西", "镇安", "治安", "招柏", "张百湾", "中川机场", "枝城", "子长", "诸城", "邹城", "赵城", "章党", "正定", "肇东", "照福铺", "章古台", "赵光", "中和", "中华门", "枝江北", "钟家村", "朱家沟", "紫荆关", "周家", "诸暨", "镇江南", "周家屯", "湛江西", "朱家窑", "曾家坪子", "张兰", "镇赉", "枣林", "扎鲁特", "扎赉诺尔西", "樟木头", "中牟", "中宁东", "中宁", "中宁南", "镇平", "漳平", "泽普", "枣强", "张桥", "章丘", "朱日和", "泽润里", "中山北", "樟树东", "珠斯花", "中山", "柞水", "钟山", "樟树", "珠窝", "张维屯", "彰武", "棕溪", "钟祥", "资溪", "镇西", "张辛", "正镶白旗", "紫阳", "枣阳", "竹园坝", "张掖", "镇远", "漳州东", "漳州", "壮志", "子洲", "中寨", "咋子", "卓资山", "株洲西", "郑州西", "查干湖"]}];

    var chooseCitys = document.getElementsByClassName("chooseCity");
    var texts = document.getElementsByClassName("text");

    var inputStart = document.getElementById("start");
    var inputDestination = document.getElementById("destination");

    $(document).bind('click', function(e) {
        var e = e || window.event;
        var elem = e.target || e.srcElement;
        if(elem === inputStart && chooseCitys[1].style.display === "block"){
            chooseCitys[1].style.display = "none";
            return;
        }
        if(elem === inputDestination && chooseCitys[0].style.display === "block"){
            chooseCitys[0].style.display = "none";
            return;
        }
        if(elem === inputStart || elem === inputDestination){
            return;
        }
        while (elem) { //循环判断至跟节点，防止点击的是div子元素
            if (elem && elem === chooseCitys[0] || elem && elem === chooseCitys[1]) {
                return;
            }
            elem = elem.parentNode;
        }
        chooseCitys[0].style.display = "none";
        chooseCitys[1].style.display = "none";
    });


    inputStart.onclick = function () {
        chooseCitys[0].style.top = this.offsetTop + this.offsetHeight + "px";
        chooseCitys[0].style.display = "block";
    }

    inputDestination.onclick = function () {
        chooseCitys[1].style.top = this.offsetTop + this.offsetHeight + "px";
        chooseCitys[1].style.display = "block";
    }

    result(chooseCitys[0]);
    result(chooseCitys[1]);


    function result(obj) {
        var as = new Array();
        as.push(obj.children[0], obj.children[1], obj.children[2], obj.children[3], obj.children[4], obj.children[5]);
        var text = obj.children[7];


        for(var i=0; i<as.length; i++){
            as[i].onclick = function () {
                text.innerText = "";
                for(var j=0; j<this.innerText.length; j++){
                    var newH = document.createElement("h4");
                    newH.innerText = this.innerText.charAt(j);
                    text.appendChild(newH);
                    for(var k=0; k<citys.length; k++){
                        if(citys[k].letter === this.innerText.charAt([j])){

                            for(var n=0; n<citys[k].city.length; n++){
                                var newA = document.createElement("a");
                                newA.innerText = citys[k].city[n];
                                newA.onclick = function () {
                                    if(obj === chooseCitys[0]){
                                        inputStart.value = this.innerText;
                                        obj.style.display = "none";
                                    }
                                    if(obj === chooseCitys[1]){
                                        inputDestination.value = this.innerText;
                                        obj.style.display = "none";
                                    }
                                }
                                text.appendChild(newA);
                            }
                        }
                    }
                }
            }
        }
    }
}


